{
    "gpt3_role": "You are a financial assistant specializing in home loans and refinancing in Malaysia. Your role is to answer user questions clearly and provide helpful, specific guidance on refinancing, housing loans, and financial planning in Malaysia.",
    "example_queries": [
        "What is refinancing?",
        "How does refinancing save money?",
        "How do I calculate my loan interest rate?",
        "What is the best bank for refinancing in Malaysia?",
        "What fees are involved in refinancing a home loan?",
        "What documents do I need to apply for a home loan?",
        "How long does it take to process a refinancing application?",
        "What is a lock-in period in a home loan?",
        "What is the difference between fixed and floating interest rates?",
        "Can I refinance my loan if I have a bad credit score?"
    ],
    "language_handling": {
        "ms": "Handle the entire conversation in Malay. Answer clearly and professionally.",
        "zh": "Handle the entire conversation in Chinese. Answer clearly and professionally."
    },
    "en": {
        "what is refinancing?": "Refinancing is the process of replacing your existing home loan with a new one, usually with better interest rates, lower monthly payments, or shorter loan tenure.",
        "how does refinancing save money?": "Refinancing can save you money by reducing your monthly payments, lowering your interest rate, or shortening your loan tenure, all of which reduce the total interest paid.",
        "what documents do i need to apply for a home loan?": "To apply for a home loan in Malaysia, you typically need to provide your ID, latest payslips, EPF statement, bank statements, and proof of existing debts (if any).",
        "how long does it take to process a refinancing application?": "A refinancing application typically takes 1 to 3 months, depending on the bank, documentation, and valuation process.",
        "what is a lock-in period in a home loan?": "A lock-in period is a period during which you cannot refinance or pay off your home loan early without paying a penalty fee.",
        "what is the difference between fixed and floating interest rates?": "A fixed interest rate remains constant throughout the loan tenure, while a floating rate changes based on market conditions (e.g., changes in the OPR).",
        "can i refinance my loan if i have a bad credit score?": "Yes, but it may be more challenging. Lenders may charge higher interest rates or impose stricter requirements if you have a poor credit score."
    },
    "ms": {
        "apa itu pembiayaan semula?": "Pembiayaan semula adalah proses menggantikan pinjaman rumah sedia ada anda dengan pinjaman baru, biasanya dengan kadar faedah yang lebih rendah, ansuran bulanan yang lebih rendah, atau tempoh pinjaman yang lebih pendek.",
        "bagaimana pembiayaan semula menjimatkan wang?": "Pembiayaan semula dapat menjimatkan wang anda dengan mengurangkan pembayaran bulanan, mengurangkan kadar faedah, atau memendekkan tempoh pinjaman, yang mengurangkan jumlah faedah keseluruhan yang dibayar.",
        "apakah dokumen yang diperlukan untuk memohon pinjaman rumah?": "Untuk memohon pinjaman rumah di Malaysia, anda biasanya perlu memberikan kad pengenalan (IC), slip gaji terkini, penyata EPF, penyata bank, dan bukti hutang sedia ada (jika ada).",
        "berapa lama proses permohonan pembiayaan semula?": "Proses permohonan pembiayaan semula biasanya mengambil masa 1 hingga 3 bulan, bergantung kepada bank, dokumentasi, dan proses penilaian.",
        "apakah tempoh kunci dalam pinjaman rumah?": "Tempoh kunci ialah tempoh di mana anda tidak boleh membuat pembiayaan semula atau melunaskan pinjaman rumah anda tanpa membayar yuran penalti.",
        "apakah perbezaan antara kadar faedah tetap dan terapung?": "Kadar faedah tetap kekal sama sepanjang tempoh pinjaman, manakala kadar faedah terapung berubah berdasarkan keadaan pasaran (contohnya, perubahan dalam Kadar Dasar Semalaman (OPR)).",
        "bolehkah saya membuat pembiayaan semula jika skor kredit saya rendah?": "Ya, tetapi ia mungkin lebih mencabar. Pemberi pinjaman mungkin mengenakan kadar faedah yang lebih tinggi atau syarat yang lebih ketat jika anda mempunyai skor kredit yang rendah."
    },
    "zh": {
        "什么是再融资?": "再融资是将您现有的房屋贷款替换为一个新的贷款，通常具有更低的利率、更低的每月还款额或更短的贷款期限。",
        "再融资如何省钱?": "再融资可以通过减少每月还款额、降低利率或缩短贷款期限来帮助您省钱，从而减少支付的总利息。",
        "申请房屋贷款需要哪些文件?": "在马来西亚申请房屋贷款，通常需要提供身份证、最近的工资单、EPF（公积金）声明、银行对账单和现有债务的证明（如果有）。",
        "再融资申请需要多长时间?": "再融资申请的处理时间通常为1至3个月，这取决于银行、文件的完整性和评估过程。",
        "什么是贷款锁定期?": "贷款锁定期是指在一定时间内，您不能提前偿还贷款或再融资，否则将支付违约金。",
        "固定利率和浮动利率有什么区别?": "固定利率在整个贷款期限内保持不变，而浮动利率根据市场条件（例如，隔夜政策利率的变化）而波动。",
        "如果我的信用评分不好，我可以再融资吗?": "是的，但这可能更具挑战性。如果您的信用评分较低，贷方可能会收取更高的利率或实施更严格的要求。"
    }
}
